ConfigFiles/Catalogs/ВидыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыПланов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВидовПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастникиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСогласуемогоРесурсаПлановыхРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСогласуемыхРесурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговоеЗначениеПрочихРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОформленияНезаполненнаяЦель</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОформленияНезаполненоЧтоДостигнуто</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскийПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладельцыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговоеЗначениеЭтапаПопаданиеВПланЗанятости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативПланируемогоВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогОтклоненияОтНормативаПланируемогоВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПланирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПериодичностьПланов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПериодов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВладельцыПлана</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Enums/СтатусыВидовПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыВидовПланов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеАктуален</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/ТипыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПланов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занятости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/Catalogs/ВидыПланов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Статус                              = Перечисления.СтатусыВидовПланов.Черновик;
	ВидСогласуемогоРесурсаПлановыхРабот = Справочники.ВидыСогласуемыхРесурсов.ВидРесурсаПоУмолчанию(); 
	
	Если ДанныеЗаполнения = Неопределено
		Или Не ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		Или Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "ТипПлана") Тогда
		
		ТипПлана = Перечисления.ТипыПланов.Рабочий;
		
	Иначе
		
		ТипПлана = ДанныеЗаполнения.ТипПлана;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеРесурсов") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидСогласуемогоРесурсаПлановыхРабот");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НормативПланируемогоВремени = 0 
		И ПорогОтклоненияОтНормативаПланируемогоВремени > 0 Тогда
		
		ПорогОтклоненияОтНормативаПланируемогоВремени = 0;
		
	КонецЕсли;
	
	ОчиститьДублиТабличнойЧастиСПользователями("УчастникиПланирования", "Участник");
	ОчиститьДублиТабличнойЧастиСПользователями("ВладельцыПлана",        "Владелец");
	
	СформироватьПредставлениеТабличнойЧастиПоПользователям("УчастникиПланирования", 
	                                                       "Участник", 
	                                                       УчастникиСтрокой, 
	                                                       НСтр("ru = 'Участников'"));
	
	СформироватьПредставлениеТабличнойЧастиПоПользователям("ВладельцыПлана", 
	                                                       "Владелец", 
	                                                       ВладельцыСтрокой, 
	                                                       НСтр("ru = 'Владельцев'"));
	
	ПроверитьСоответвиеПланаЗанятостиПодчиненнымПланам(Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Справочники.ВидыПланов.УдалитьНеСоответствующиеНастройкамПланы(Ссылка);
	Если Статус = Перечисления.СтатусыВидовПланов.Действует Тогда
		Справочники.ВидыПланов.СоздатьПланыПоВидуПланаЕслиНеобходимо(Ссылка, НачалоДня(ТекущаяДатаСеанса()), 4);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьПредставлениеТабличнойЧастиПоПользователям(ИмяТабличнойЧасти, ИмяКолонки, РеквизитПредставление, ЗаголовокПредставления)
	
	РеквизитПредставление = "";
	КоличествоПользователей = ЭтотОбъект[ИмяТабличнойЧасти].Количество();
	
	Если КоличествоПользователей = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если КоличествоПользователей > 3 Тогда
		РеквизитПредставление = СтрШаблон(НСтр("ru = '%1 - %2, в т.ч.'"), ЗаголовокПредставления, КоличествоПользователей);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 3
	|	Пользователи.Представление КАК Представление
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка В(&МассивУчастников)";
	
	Запрос.УстановитьПараметр("МассивУчастников", ЭтотОбъект[ИмяТабличнойЧасти].ВыгрузитьКолонку(ИмяКолонки));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Индекс = 0;
	
	Пока Выборка.Следующий() Цикл
	
		Если Индекс = 0 Тогда
			РеквизитПредставление = РеквизитПредставление + " ";
		Иначе
			РеквизитПредставление = РеквизитПредставление + ", ";
		КонецЕсли;
		
		РеквизитПредставление = РеквизитПредставление + Выборка.Представление;
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	РеквизитПредставление = РеквизитПредставление + ".";
	
КонецПроцедуры

Процедура ОчиститьДублиТабличнойЧастиСПользователями(ИмяТабличнойЧасти, ИмяКолонки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.ИмяКолонки  КАК Пользователь,
	|	ТабличнаяЧасть.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.Пользователь             КАК Пользователь,
	|	КОЛИЧЕСТВО(ТабличнаяЧасть.Пользователь) КАК Количество
	|ИЗ
	|	ТабличнаяЧасть КАК ТабличнаяЧасть
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабличнаяЧасть.Пользователь
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ТабличнаяЧасть.Пользователь) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Пользователь КАК Пользователь
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабличнаяЧасть.Пользователь КАК Пользователь,
	|		МИНИМУМ(ТабличнаяЧасть.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		ТабличнаяЧасть КАК ТабличнаяЧасть
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТабличнаяЧасть.Пользователь) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.НомерСтроки";
	
	Запрос.УстановитьПараметр("ТабличнаяЧасть",      ЭтотОбъект[ИмяТабличнойЧасти].Выгрузить());
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабличнаяЧасть.ИмяКолонки", "ТабличнаяЧасть." + ИмяКолонки);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если Результат[1].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[ИмяТабличнойЧасти].Очистить();
	
	Выборка = Результат[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока             = ЭтотОбъект[ИмяТабличнойЧасти].Добавить();
		НоваяСтрока[ИмяКолонки] = Выборка.Пользователь;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСоответвиеПланаЗанятостиПодчиненнымПланам(Отказ)
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипПлана = Перечисления.ТипыПланов.Занятости Тогда
		
		ТекущиеНастройкиПланирования = НастройкиПланирования[0];
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ВидыПланов.Ссылка                                  КАК Ссылка,
		|	ВидыПланов.Наименование                            КАК Наименование,
		|	ВидыПлановНастройкиПланирования.Периодичность      КАК Периодичность,
		|	ВидыПлановНастройкиПланирования.КоличествоПериодов КАК КоличествоПериодов,
		|	ВидыПлановНастройкиПланирования.НачалоДействия     КАК НачалоДействия,
		|	ВидыПлановНастройкиПланирования.КонецДействия      КАК КонецДействия
		|ИЗ
		|	Справочник.ВидыПланов.НастройкиПланирования КАК ВидыПлановНастройкиПланирования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыПланов КАК ВидыПланов
		|		ПО ВидыПлановНастройкиПланирования.Ссылка = ВидыПланов.Ссылка
		|ГДЕ
		|	НЕ ВидыПланов.ПометкаУдаления
		|	И ВидыПланов.РодительскийПлан = &ТекущийПлан
		|	И ВидыПланов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВидовПланов.Действует)
		|	И ВидыПлановНастройкиПланирования.НомерСтроки = 1";
		
		Запрос.УстановитьПараметр("ТекущийПлан", Ссылка);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			Если ТекущиеНастройкиПланирования.Периодичность <> Выборка.Периодичность Тогда
				
				СообщитьОжидаемыеНастройкиПодчиненныхПланов(Выборка.Ссылка, Выборка.Наименование, Отказ);
				Продолжить;
				
			КонецЕсли;
			
			Если ТекущиеНастройкиПланирования.КоличествоПериодов <> Выборка.КоличествоПериодов Тогда
				
				СообщитьОжидаемыеНастройкиПодчиненныхПланов(Выборка.Ссылка, Выборка.Наименование, Отказ);
				Продолжить;
				
			КонецЕсли;
			
			ДанныеПланаЗанятости = Новый Структура;
			ДанныеПланаЗанятости.Вставить("Периодичность",      ТекущиеНастройкиПланирования.Периодичность);
			ДанныеПланаЗанятости.Вставить("КоличествоПериодов", ТекущиеНастройкиПланирования.КоличествоПериодов);
			ДанныеПланаЗанятости.Вставить("НачалоДействия",     ТекущиеНастройкиПланирования.НачалоДействия); 
			
			ДатаНачинаяСКорректна = Справочники.ВидыПланов.ДатаНачалаПланированияСоответсвуетРодительскомуПлану(Выборка.НачалоДействия,
			                                                                                                    ДанныеПланаЗанятости);
			
			Если Не ДатаНачинаяСКорректна Тогда
				СообщитьОжидаемыеНастройкиПодчиненныхПланов(Выборка.Ссылка, Выборка.Наименование,Отказ);
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьОжидаемыеНастройкиПодчиненныхПланов(ВидПлана, НаименованиеВидаПодчиненогоПлана, Отказ)
	
	ТекстСообщения = НСтр("ru = 'Для данного плана занятости уже существут подчиненный действующий рабочий план ""%1"" и его настройки не соответствуют новым настройкам периодичности планирования'");
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, НаименованиеВидаПодчиненогоПлана),
	                                      ВидПлана,,, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
